0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            pressureDirectedInletVelocity;
        inletDirection  uniform (1 0 0);
        value           uniform (0 0 0);
    }
    topAndBottom
    {
        type            pressureDirectedInletVelocity;
        inletDirection  uniform (1 0 0);
        value           uniform (0 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    airfoil
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
